Revit 2027 API
BuiltInFailures.RebarSystemFailures.BarsTooCloseNumber Property
 Bars are too close together. Decrease the Number Of Lines parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BarsTooCloseNumber { get; }
Public Shared ReadOnly Property BarsTooCloseNumber As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BarsTooCloseNumber {
	FailureDefinitionId^ get ();
}
static member BarsTooCloseNumber : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace